app/Controllers/Email.php

    public function insertar()
    {
        $tp = $this->request->getPost('tp_email');
        if ($tp == 1) {

            $this->email->save([
                'email' => $this->request->getPost('email'),
                'prioridad' => $this->request->getPost('prioridad'),
                'id_usuario' => $this->request->getPost('id_usuario'),
                'usuario_crea' => session('id'),
            ]);
---
INSERT INTO `emails` (`email`, `prioridad`, `id_usuario`, `usuario_crea`, `fecha_crea`) VALUES ('cd@gmail.comk', '6', '3', '5', '2023-04-22 01:58:13')