app/Models/HorarioModel.php

SELECT `horario`.*
FROM `horario`
---
    public function vistaHorarioPrueba()
    {
        $this->select('*');
        // $this->from('horario');
        $datos = $this->findAll();